hostname = `hostname -s`.strip

is_home = (hostname == "vbmaca")

brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "mas"
brew "p7zip"
brew "ripgrep"
brew "stow"
brew "tmux"

tap "homebrew/cask-versions"

cask "1password"
cask "affinity-designer"
cask "brave-browser"
cask "docker"
cask "figma"
cask "iterm2"
cask "logi-options-plus"
cask "protonvpn"
cask "visual-studio-code"

cask "homebrew/cask-fonts/font-cascadia-code"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Grammarly: Writing App", id: 1462114288
mas "iA Writer", id: 775737590
mas "OmniFocus 3", id: 1346203938

mas "Keynote", id: 409183694 
mas "Numbers", id: 409203825 
mas "Pages", id: 409201541
